/*******************************************************************************
* 实 验 名		 : 步进电机实验
* 使用的IO	     : 电机用P1.0/P1.1/P1.2/P1.3
* 实验效果       : 
* 注    意		 ：由于P3.2口跟红外线共用，所以做按键实验时为了不让红外线影响实验
*效果，最好把红外线先取下来。
*******************************************************************************/ 
#include "reg52.h"

//电机IO
#define GPIO_MOTOR P1
//sbit F1 = P1^0;
//sbit F2 = P1^1;
//sbit F3 = P1^2;
//sbit F4 = P1^3;
//按键IO
sbit K1=P3^0;
sbit K2=P3^1;
sbit K3=P3^2;
sbit K4=P3^3;

unsigned char code FFW[8]={0xf1,0xf3,0xf2,0xf6,0xf4,0xfc,0xf8,0xf9}; //反转顺序

void Delay(unsigned int t);
void  Motor(); 

/*******************************************************************************
* 函 数 名         : main
* 函数功能		   : 主函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void main(void) 
{ 
  while(1)
	{
		Motor();
	}
}
/*******************************************************************************
* 函 数 名         : Motor
* 函数功能		   : 电机旋转函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void  Motor()
{ 
	unsigned char i;
	for(i=0;i<8;i++)
	{ 
		GPIO_MOTOR = FFW[i]&0x1f;  //取数据
		Delay(30);	//调节转速	
	}	                  
}
/*******************************************************************************
* 函 数 名         : Delay
* 函数功能		   : 延时
* 输    入         : t
* 输    出         : 无
*******************************************************************************/
void Delay(unsigned int t)
{                           
	unsigned int k;
	while(t--)
	{
		for(k=0; k<80; k++)
		{ }
	}
}



